frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/gpio.h
/**
 * \file
 *
 * \brief Component description for GPIO
 *
 * Copyright (c) 2016 Atmel Corporation,
 *                    a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the Licence at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM4L_GPIO_COMPONENT_
#define _SAM4L_GPIO_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR GPIO */
/* ========================================================================== */
/** \addtogroup SAM4L_GPIO General-Purpose Input/Output Controller */
/*@{*/

#define GPIO_I7512
#define REV_GPIO                    0x215

/* -------- GPIO_GPER : (GPIO Offset: 0x000) (R/W 32) port GPIO Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t P0:1;             /*!< bit:      0  GPIO Enable                        */
    uint32_t P1:1;             /*!< bit:      1  GPIO Enable                        */
    uint32_t P2:1;             /*!< bit:      2  GPIO Enable                        */
    uint32_t P3:1;             /*!< bit:      3  GPIO Enable                        */
    uint32_t P4:1;             /*!< bit:      4  GPIO Enable                        */
    uint32_t P5:1;             /*!< bit:      5  GPIO Enable                        */
    uint32_t P6:1;             /*!< bit:      6  GPIO Enable                        */
    uint32_t P7:1;             /*!< bit:      7  GPIO Enable                        */
    uint32_t P8:1;             /*!< bit:      8  GPIO Enable                        */
    uint32_t P9:1;             /*!< bit:      9  GPIO Enable                        */
    uint32_t P10:1;            /*!< bit:     10  GPIO Enable                        */
    uint32_t P11:1;            /*!< bit:     11  GPIO Enable                        */
    uint32_t P12:1;            /*!< bit:     12  GPIO Enable                        */
    uint32_t P13:1;            /*!< bit:     13  GPIO Enable                        */
    uint32_t P14:1;            /*!< bit:     14  GPIO Enable                        */
    uint32_t P15:1;            /*!< bit:     15  GPIO Enable                        */
    uint32_t P16:1;            /*!< bit:     16  GPIO Enable                        */
    uint32_t P17:1;            /*!< bit:     17  GPIO Enable                        */
    uint32_t P18:1;            /*!< bit:     18  GPIO Enable                        */
    uint32_t P19:1;            /*!< bit:     19  GPIO Enable                        */
    uint32_t P20:1;            /*!< bit:     20  GPIO Enable                        */
    uint32_t P21:1;            /*!< bit:     21  GPIO Enable                        */
    uint32_t P22:1;            /*!< bit:     22  GPIO Enable                        */
    uint32_t P23:1;            /*!< bit:     23  GPIO Enable                        */
    uint32_t P24:1;            /*!< bit:     24  GPIO Enable                        */
    uint32_t P25:1;            /*!< bit:     25  GPIO Enable                        */
    uint32_t P26:1;            /*!< bit:     26  GPIO Enable                        */
    uint32_t P27:1;            /*!< bit:     27  GPIO Enable                        */
    uint32_t P28:1;            /*!< bit:     28  GPIO Enable                        */
    uint32_t P29:1;            /*!< bit:     29  GPIO Enable                        */
    uint32_t P30:1;            /*!< bit:     30  GPIO Enable                        */
    uint32_t P31:1;            /*!< bit:     31  GPIO Enable                        */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} GPIO_GPER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_GPER_OFFSET            0x000        /**< \brief (GPIO_GPER offset) GPIO Enable Register */

#define GPIO_GPER_P0_Pos            0            /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P0                (_U(0x1) << GPIO_GPER_P0_Pos)
#define GPIO_GPER_P1_Pos            1            /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P1                (_U(0x1) << GPIO_GPER_P1_Pos)
#define GPIO_GPER_P2_Pos            2            /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P2                (_U(0x1) << GPIO_GPER_P2_Pos)
#define GPIO_GPER_P3_Pos            3            /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P3                (_U(0x1) << GPIO_GPER_P3_Pos)
#define GPIO_GPER_P4_Pos            4            /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P4                (_U(0x1) << GPIO_GPER_P4_Pos)
#define GPIO_GPER_P5_Pos            5            /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P5                (_U(0x1) << GPIO_GPER_P5_Pos)
#define GPIO_GPER_P6_Pos            6            /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P6                (_U(0x1) << GPIO_GPER_P6_Pos)
#define GPIO_GPER_P7_Pos            7            /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P7                (_U(0x1) << GPIO_GPER_P7_Pos)
#define GPIO_GPER_P8_Pos            8            /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P8                (_U(0x1) << GPIO_GPER_P8_Pos)
#define GPIO_GPER_P9_Pos            9            /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P9                (_U(0x1) << GPIO_GPER_P9_Pos)
#define GPIO_GPER_P10_Pos           10           /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P10               (_U(0x1) << GPIO_GPER_P10_Pos)
#define GPIO_GPER_P11_Pos           11           /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P11               (_U(0x1) << GPIO_GPER_P11_Pos)
#define GPIO_GPER_P12_Pos           12           /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P12               (_U(0x1) << GPIO_GPER_P12_Pos)
#define GPIO_GPER_P13_Pos           13           /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P13               (_U(0x1) << GPIO_GPER_P13_Pos)
#define GPIO_GPER_P14_Pos           14           /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P14               (_U(0x1) << GPIO_GPER_P14_Pos)
#define GPIO_GPER_P15_Pos           15           /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P15               (_U(0x1) << GPIO_GPER_P15_Pos)
#define GPIO_GPER_P16_Pos           16           /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P16               (_U(0x1) << GPIO_GPER_P16_Pos)
#define GPIO_GPER_P17_Pos           17           /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P17               (_U(0x1) << GPIO_GPER_P17_Pos)
#define GPIO_GPER_P18_Pos           18           /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P18               (_U(0x1) << GPIO_GPER_P18_Pos)
#define GPIO_GPER_P19_Pos           19           /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P19               (_U(0x1) << GPIO_GPER_P19_Pos)
#define GPIO_GPER_P20_Pos           20           /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P20               (_U(0x1) << GPIO_GPER_P20_Pos)
#define GPIO_GPER_P21_Pos           21           /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P21               (_U(0x1) << GPIO_GPER_P21_Pos)
#define GPIO_GPER_P22_Pos           22           /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P22               (_U(0x1) << GPIO_GPER_P22_Pos)
#define GPIO_GPER_P23_Pos           23           /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P23               (_U(0x1) << GPIO_GPER_P23_Pos)
#define GPIO_GPER_P24_Pos           24           /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P24               (_U(0x1) << GPIO_GPER_P24_Pos)
#define GPIO_GPER_P25_Pos           25           /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P25               (_U(0x1) << GPIO_GPER_P25_Pos)
#define GPIO_GPER_P26_Pos           26           /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P26               (_U(0x1) << GPIO_GPER_P26_Pos)
#define GPIO_GPER_P27_Pos           27           /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P27               (_U(0x1) << GPIO_GPER_P27_Pos)
#define GPIO_GPER_P28_Pos           28           /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P28               (_U(0x1) << GPIO_GPER_P28_Pos)
#define GPIO_GPER_P29_Pos           29           /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P29               (_U(0x1) << GPIO_GPER_P29_Pos)
#define GPIO_GPER_P30_Pos           30           /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P30               (_U(0x1) << GPIO_GPER_P30_Pos)
#define GPIO_GPER_P31_Pos           31           /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P31               (_U(0x1) << GPIO_GPER_P31_Pos)
#define GPIO_GPER_MASK              _U(0xFFFFFFFF) /**< \brief (GPIO_GPER) MASK Register */

/* -------- GPIO_GPERS : (GPIO Offset: 0x004) ( /W 32) port GPIO Enable Register - Set -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t P0:1;             /*!< bit:      0  GPIO Enable                        */
    uint32_t P1:1;             /*!< bit:      1  GPIO Enable                        */
    uint32_t P2:1;             /*!< bit:      2  GPIO Enable                        */
    uint32_t P3:1;             /*!< bit:      3  GPIO Enable                        */
    uint32_t P4:1;             /*!< bit:      4  GPIO Enable                        */
    uint32_t P5:1;             /*!< bit:      5  GPIO Enable                        */
    uint32_t P6:1;             /*!< bit:      6  GPIO Enable                        */
    uint32_t P7:1;             /*!< bit:      7  GPIO Enable                        */
    uint32_t P8:1;             /*!< bit:      8  GPIO Enable                        */
    uint32_t P9:1;             /*!< bit:      9  GPIO Enable                        */
    uint32_t P10:1;            /*!< bit:     10  GPIO Enable                        */
    uint32_t P11:1;            /*!< bit:     11  GPIO Enable                        */
    uint32_t P12:1;            /*!< bit:     12  GPIO Enable                        */
    uint32_t P13:1;            /*!< bit:     13  GPIO Enable                        */
    uint32_t P14:1;            /*!< bit:     14  GPIO Enable                        */
    uint32_t P15:1;            /*!< bit:     15  GPIO Enable                        */
    uint32_t P16:1;            /*!< bit:     16  GPIO Enable                        */
    uint32_t P17:1;            /*!< bit:     17  GPIO Enable                        */
    uint32_t P18:1;            /*!< bit:     18  GPIO Enable                        */
    uint32_t P19:1;            /*!< bit:     19  GPIO Enable                        */
    uint32_t P20:1;            /*!< bit:     20  GPIO Enable                        */
    uint32_t P21:1;            /*!< bit:     21  GPIO Enable                        */
    uint32_t P22:1;            /*!< bit:     22  GPIO Enable                        */
    uint32_t P23:1;            /*!< bit:     23  GPIO Enable                        */
    uint32_t P24:1;            /*!< bit:     24  GPIO Enable                        */
    uint32_t P25:1;            /*!< bit:     25  GPIO Enable                        */
    uint32_t P26:1;            /*!< bit:     26  GPIO Enable                        */
    uint32_t P27:1;            /*!< bit:     27  GPIO Enable                        */
    uint32_t P28:1;            /*!< bit:     28  GPIO Enable                        */
    uint32_t P29:1;            /*!< bit:     29  GPIO Enable                        */
    uint32_t P30:1;            /*!< bit:     30  GPIO Enable                        */
    uint32_t P31:1;            /*!< bit:     31  GPIO Enable                        */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} GPIO_GPERS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_GPERS_OFFSET           0x004        /**< \brief (GPIO_GPERS offset) GPIO Enable Register - Set */

#define GPIO_GPERS_P0_Pos           0            /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P0               (_U(0x1) << GPIO_GPERS_P0_Pos)
#define GPIO_GPERS_P1_Pos           1            /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P1               (_U(0x1) << GPIO_GPERS_P1_Pos)
#define GPIO_GPERS_P2_Pos           2            /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P2               (_U(0x1) << GPIO_GPERS_P2_Pos)
#define GPIO_GPERS_P3_Pos           3            /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P3               (_U(0x1) << GPIO_GPERS_P3_Pos)
#define GPIO_GPERS_P4_Pos           4            /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P4               (_U(0x1) << GPIO_GPERS_P4_Pos)
#define GPIO_GPERS_P5_Pos           5            /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P5               (_U(0x1) << GPIO_GPERS_P5_Pos)
#define GPIO_GPERS_P6_Pos           6            /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P6               (_U(0x1) << GPIO_GPERS_P6_Pos)
#define GPIO_GPERS_P7_Pos           7            /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P7               (_U(0x1) << GPIO_GPERS_P7_Pos)
#define GPIO_GPERS_P8_Pos           8            /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P8               (_U(0x1) << GPIO_GPERS_P8_Pos)
#define GPIO_GPERS_P9_Pos           9            /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P9               (_U(0x1) << GPIO_GPERS_P9_Pos)
#define GPIO_GPERS_P10_Pos          10           /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P10              (_U(0x1) << GPIO_GPERS_P10_Pos)
#define GPIO_GPERS_P11_Pos          11           /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P11              (_U(0x1) << GPIO_GPERS_P11_Pos)
#define GPIO_GPERS_P12_Pos          12           /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P12              (_U(0x1) << GPIO_GPERS_P12_Pos)
#define GPIO_GPERS_P13_Pos          13           /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P13              (_U(0x1) << GPIO_GPERS_P13_Pos)
#define GPIO_GPERS_P14_Pos          14           /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P14              (_U(0x1) << GPIO_GPERS_P14_Pos)
#define GPIO_GPERS_P15_Pos          15           /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P15              (_U(0x1) << GPIO_GPERS_P15_Pos)
#define GPIO_GPERS_P16_Pos          16           /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P16              (_U(0x1) << GPIO_GPERS_P16_Pos)
#define GPIO_GPERS_P17_Pos          17           /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P17              (_U(0x1) << GPIO_GPERS_P17_Pos)
#define GPIO_GPERS_P18_Pos          18           /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P18              (_U(0x1) << GPIO_GPERS_P18_Pos)
#define GPIO_GPERS_P19_Pos          19           /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P19              (_U(0x1) << GPIO_GPERS_P19_Pos)
#define GPIO_GPERS_P20_Pos          20           /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P20              (_U(0x1) << GPIO_GPERS_P20_Pos)
#define GPIO_GPERS_P21_Pos          21           /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P21              (_U(0x1) << GPIO_GPERS_P21_Pos)
#define GPIO_GPERS_P22_Pos          22           /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P22              (_U(0x1) << GPIO_GPERS_P22_Pos)
#define GPIO_GPERS_P23_Pos          23           /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P23              (_U(0x1) << GPIO_GPERS_P23_Pos)
#define GPIO_GPERS_P24_Pos          24           /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P24              (_U(0x1) << GPIO_GPERS_P24_Pos)
#define GPIO_GPERS_P25_Pos          25           /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P25              (_U(0x1) << GPIO_GPERS_P25_Pos)
#define GPIO_GPERS_P26_Pos          26           /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P26              (_U(0x1) << GPIO_GPERS_P26_Pos)
#define GPIO_GPERS_P27_Pos          27           /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P27              (_U(0x1) << GPIO_GPERS_P27_Pos)
#define GPIO_GPERS_P28_Pos          28           /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P28              (_U(0x1) << GPIO_GPERS_P28_Pos)
#define GPIO_GPERS_P29_Pos          29           /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P29              (_U(0x1) << GPIO_GPERS_P29_Pos)
#define GPIO_GPERS_P30_Pos          30           /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P30              (_U(0x1) << GPIO_GPERS_P30_Pos)
#define GPIO_GPERS_P31_Pos          31           /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P31              (_U(0x1) << GPIO_GPERS_P31_Pos)
#define GPIO_GPERS_MASK             _U(0xFFFFFFFF) /**< \brief (GPIO_GPERS) MASK Register */

/* -------- GPIO_GPERC : (GPIO Offset: 0x008) ( /W 32) port GPIO Enable Register - Clear -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t P0:1;             /*!< bit:      0  GPIO Enable                        */
    uint32_t P1:1;             /*!< bit:      1  GPIO Enable                        */
    uint32_t P2:1;             /*!< bit:      2  GPIO Enable                        */
    uint32_t P3:1;             /*!< bit:      3  GPIO Enable                        */
    uint32_t P4:1;             /*!< bit:      4  GPIO Enable                        */
    uint32_t P5:1;             /*!< bit:      5  GPIO Enable                        */
    uint32_t P6:1;             /*!< bit:      6  GPIO Enable                        */
    uint32_t P7:1;             /*!< bit:      7  GPIO Enable                        */
    uint32_t P8:1;             /*!< bit:      8  GPIO Enable                        */
    uint32_t P9:1;             /*!< bit:      9  GPIO Enable                        */
    uint32_t P10:1;            /*!< bit:     10  GPIO Enable                        */
    uint32_t P11:1;            /*!< bit:     11  GPIO Enable                        */
    uint32_t P12:1;            /*!< bit:     12  GPIO Enable                        */
    uint32_t P13:1;            /*!< bit:     13  GPIO Enable                        */
    uint32_t P14:1;            /*!< bit:     14  GPIO Enable                        */
    uint32_t P15:1;            /*!< bit:     15  GPIO Enable                        */
    uint32_t P16:1;            /*!< bit:     16  GPIO Enable                        */
    uint32_t P17:1;            /*!< bit:     17  GPIO Enable                        */
    uint32_t P18:1;            /*!< bit:     18  GPIO Enable                        */
    uint32_t P19:1;            /*!< bit:     19  GPIO Enable                        */
    uint32_t P20:1;            /*!< bit:     20  GPIO Enable                        */
    uint32_t P21:1;            /*!< bit:     21  GPIO Enable                        */
    uint32_t P22:1;            /*!< bit:     22  GPIO Enable                        */
    uint32_t P23:1;            /*!< bit:     23  GPIO Enable                        */
    uint32_t P24:1;            /*!< bit:     24  GPIO Enable                        */
    uint32_t P25:1;            /*!< bit:     25  GPIO Enable                        */
    uint32_t P26:1;            /*!< bit:     26  GPIO Enable                        */
    uint32_t P27:1;            /*!< bit:     27  GPIO Enable                        */
    uint32_t P28:1;            /*!< bit:     28  GPIO Enable                        */
    uint32_t P29:1;            /*!< bit:     29  GPIO Enable                        */
    uint32_t P30:1;            /*!< bit:     30  GPIO Enable                        */
    uint32_t P31:1;            /*!< bit:     31  GPIO Enable                        */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} GPIO_GPERC_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_GPERC_OFFSET           0x008        /**< \brief (GPIO_GPERC offset) GPIO Enable Register - Clear */

