frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/gpio.h
/* -------- GPIO_ODERS : (GPIO Offset: 0x044) ( /W 32) port Output Driver Enable Register - Set -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t P0:1;             /*!< bit:      0  Output Driver Enable               */
    uint32_t P1:1;             /*!< bit:      1  Output Driver Enable               */
    uint32_t P2:1;             /*!< bit:      2  Output Driver Enable               */
    uint32_t P3:1;             /*!< bit:      3  Output Driver Enable               */
    uint32_t P4:1;             /*!< bit:      4  Output Driver Enable               */
    uint32_t P5:1;             /*!< bit:      5  Output Driver Enable               */
    uint32_t P6:1;             /*!< bit:      6  Output Driver Enable               */
    uint32_t P7:1;             /*!< bit:      7  Output Driver Enable               */
    uint32_t P8:1;             /*!< bit:      8  Output Driver Enable               */
    uint32_t P9:1;             /*!< bit:      9  Output Driver Enable               */
    uint32_t P10:1;            /*!< bit:     10  Output Driver Enable               */
    uint32_t P11:1;            /*!< bit:     11  Output Driver Enable               */
    uint32_t P12:1;            /*!< bit:     12  Output Driver Enable               */
    uint32_t P13:1;            /*!< bit:     13  Output Driver Enable               */
    uint32_t P14:1;            /*!< bit:     14  Output Driver Enable               */
    uint32_t P15:1;            /*!< bit:     15  Output Driver Enable               */
    uint32_t P16:1;            /*!< bit:     16  Output Driver Enable               */
    uint32_t P17:1;            /*!< bit:     17  Output Driver Enable               */
    uint32_t P18:1;            /*!< bit:     18  Output Driver Enable               */
    uint32_t P19:1;            /*!< bit:     19  Output Driver Enable               */
    uint32_t P20:1;            /*!< bit:     20  Output Driver Enable               */
    uint32_t P21:1;            /*!< bit:     21  Output Driver Enable               */
    uint32_t P22:1;            /*!< bit:     22  Output Driver Enable               */
    uint32_t P23:1;            /*!< bit:     23  Output Driver Enable               */
    uint32_t P24:1;            /*!< bit:     24  Output Driver Enable               */
    uint32_t P25:1;            /*!< bit:     25  Output Driver Enable               */
    uint32_t P26:1;            /*!< bit:     26  Output Driver Enable               */
    uint32_t P27:1;            /*!< bit:     27  Output Driver Enable               */
    uint32_t P28:1;            /*!< bit:     28  Output Driver Enable               */
    uint32_t P29:1;            /*!< bit:     29  Output Driver Enable               */
    uint32_t P30:1;            /*!< bit:     30  Output Driver Enable               */
    uint32_t P31:1;            /*!< bit:     31  Output Driver Enable               */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} GPIO_ODERS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_ODERS_OFFSET           0x044        /**< \brief (GPIO_ODERS offset) Output Driver Enable Register - Set */

#define GPIO_ODERS_P0_Pos           0            /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P0               (_U(0x1) << GPIO_ODERS_P0_Pos)
#define GPIO_ODERS_P1_Pos           1            /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P1               (_U(0x1) << GPIO_ODERS_P1_Pos)
#define GPIO_ODERS_P2_Pos           2            /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P2               (_U(0x1) << GPIO_ODERS_P2_Pos)
#define GPIO_ODERS_P3_Pos           3            /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P3               (_U(0x1) << GPIO_ODERS_P3_Pos)
#define GPIO_ODERS_P4_Pos           4            /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P4               (_U(0x1) << GPIO_ODERS_P4_Pos)
#define GPIO_ODERS_P5_Pos           5            /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P5               (_U(0x1) << GPIO_ODERS_P5_Pos)
#define GPIO_ODERS_P6_Pos           6            /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P6               (_U(0x1) << GPIO_ODERS_P6_Pos)
#define GPIO_ODERS_P7_Pos           7            /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P7               (_U(0x1) << GPIO_ODERS_P7_Pos)
#define GPIO_ODERS_P8_Pos           8            /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P8               (_U(0x1) << GPIO_ODERS_P8_Pos)
#define GPIO_ODERS_P9_Pos           9            /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P9               (_U(0x1) << GPIO_ODERS_P9_Pos)
#define GPIO_ODERS_P10_Pos          10           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P10              (_U(0x1) << GPIO_ODERS_P10_Pos)
#define GPIO_ODERS_P11_Pos          11           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P11              (_U(0x1) << GPIO_ODERS_P11_Pos)
#define GPIO_ODERS_P12_Pos          12           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P12              (_U(0x1) << GPIO_ODERS_P12_Pos)
#define GPIO_ODERS_P13_Pos          13           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P13              (_U(0x1) << GPIO_ODERS_P13_Pos)
#define GPIO_ODERS_P14_Pos          14           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P14              (_U(0x1) << GPIO_ODERS_P14_Pos)
#define GPIO_ODERS_P15_Pos          15           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P15              (_U(0x1) << GPIO_ODERS_P15_Pos)
#define GPIO_ODERS_P16_Pos          16           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P16              (_U(0x1) << GPIO_ODERS_P16_Pos)
#define GPIO_ODERS_P17_Pos          17           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P17              (_U(0x1) << GPIO_ODERS_P17_Pos)
#define GPIO_ODERS_P18_Pos          18           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P18              (_U(0x1) << GPIO_ODERS_P18_Pos)
#define GPIO_ODERS_P19_Pos          19           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P19              (_U(0x1) << GPIO_ODERS_P19_Pos)
#define GPIO_ODERS_P20_Pos          20           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P20              (_U(0x1) << GPIO_ODERS_P20_Pos)
#define GPIO_ODERS_P21_Pos          21           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P21              (_U(0x1) << GPIO_ODERS_P21_Pos)
#define GPIO_ODERS_P22_Pos          22           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P22              (_U(0x1) << GPIO_ODERS_P22_Pos)
#define GPIO_ODERS_P23_Pos          23           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P23              (_U(0x1) << GPIO_ODERS_P23_Pos)
#define GPIO_ODERS_P24_Pos          24           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P24              (_U(0x1) << GPIO_ODERS_P24_Pos)
#define GPIO_ODERS_P25_Pos          25           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P25              (_U(0x1) << GPIO_ODERS_P25_Pos)
#define GPIO_ODERS_P26_Pos          26           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P26              (_U(0x1) << GPIO_ODERS_P26_Pos)
#define GPIO_ODERS_P27_Pos          27           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P27              (_U(0x1) << GPIO_ODERS_P27_Pos)
#define GPIO_ODERS_P28_Pos          28           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P28              (_U(0x1) << GPIO_ODERS_P28_Pos)
#define GPIO_ODERS_P29_Pos          29           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P29              (_U(0x1) << GPIO_ODERS_P29_Pos)
#define GPIO_ODERS_P30_Pos          30           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P30              (_U(0x1) << GPIO_ODERS_P30_Pos)
#define GPIO_ODERS_P31_Pos          31           /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P31              (_U(0x1) << GPIO_ODERS_P31_Pos)
#define GPIO_ODERS_MASK             _U(0xFFFFFFFF) /**< \brief (GPIO_ODERS) MASK Register */

/* -------- GPIO_ODERC : (GPIO Offset: 0x048) ( /W 32) port Output Driver Enable Register - Clear -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t P0:1;             /*!< bit:      0  Output Driver Enable               */
    uint32_t P1:1;             /*!< bit:      1  Output Driver Enable               */
    uint32_t P2:1;             /*!< bit:      2  Output Driver Enable               */
    uint32_t P3:1;             /*!< bit:      3  Output Driver Enable               */
    uint32_t P4:1;             /*!< bit:      4  Output Driver Enable               */
    uint32_t P5:1;             /*!< bit:      5  Output Driver Enable               */
    uint32_t P6:1;             /*!< bit:      6  Output Driver Enable               */
    uint32_t P7:1;             /*!< bit:      7  Output Driver Enable               */
    uint32_t P8:1;             /*!< bit:      8  Output Driver Enable               */
    uint32_t P9:1;             /*!< bit:      9  Output Driver Enable               */
    uint32_t P10:1;            /*!< bit:     10  Output Driver Enable               */
    uint32_t P11:1;            /*!< bit:     11  Output Driver Enable               */
    uint32_t P12:1;            /*!< bit:     12  Output Driver Enable               */
    uint32_t P13:1;            /*!< bit:     13  Output Driver Enable               */
    uint32_t P14:1;            /*!< bit:     14  Output Driver Enable               */
    uint32_t P15:1;            /*!< bit:     15  Output Driver Enable               */
    uint32_t P16:1;            /*!< bit:     16  Output Driver Enable               */
    uint32_t P17:1;            /*!< bit:     17  Output Driver Enable               */
    uint32_t P18:1;            /*!< bit:     18  Output Driver Enable               */
    uint32_t P19:1;            /*!< bit:     19  Output Driver Enable               */
    uint32_t P20:1;            /*!< bit:     20  Output Driver Enable               */
    uint32_t P21:1;            /*!< bit:     21  Output Driver Enable               */
    uint32_t P22:1;            /*!< bit:     22  Output Driver Enable               */
    uint32_t P23:1;            /*!< bit:     23  Output Driver Enable               */
    uint32_t P24:1;            /*!< bit:     24  Output Driver Enable               */
    uint32_t P25:1;            /*!< bit:     25  Output Driver Enable               */
    uint32_t P26:1;            /*!< bit:     26  Output Driver Enable               */
    uint32_t P27:1;            /*!< bit:     27  Output Driver Enable               */
    uint32_t P28:1;            /*!< bit:     28  Output Driver Enable               */
    uint32_t P29:1;            /*!< bit:     29  Output Driver Enable               */
    uint32_t P30:1;            /*!< bit:     30  Output Driver Enable               */
    uint32_t P31:1;            /*!< bit:     31  Output Driver Enable               */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} GPIO_ODERC_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_ODERC_OFFSET           0x048        /**< \brief (GPIO_ODERC offset) Output Driver Enable Register - Clear */

#define GPIO_ODERC_P0_Pos           0            /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P0               (_U(0x1) << GPIO_ODERC_P0_Pos)
#define GPIO_ODERC_P1_Pos           1            /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P1               (_U(0x1) << GPIO_ODERC_P1_Pos)
#define GPIO_ODERC_P2_Pos           2            /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P2               (_U(0x1) << GPIO_ODERC_P2_Pos)
#define GPIO_ODERC_P3_Pos           3            /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P3               (_U(0x1) << GPIO_ODERC_P3_Pos)
#define GPIO_ODERC_P4_Pos           4            /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P4               (_U(0x1) << GPIO_ODERC_P4_Pos)
#define GPIO_ODERC_P5_Pos           5            /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P5               (_U(0x1) << GPIO_ODERC_P5_Pos)
#define GPIO_ODERC_P6_Pos           6            /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P6               (_U(0x1) << GPIO_ODERC_P6_Pos)
#define GPIO_ODERC_P7_Pos           7            /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P7               (_U(0x1) << GPIO_ODERC_P7_Pos)
#define GPIO_ODERC_P8_Pos           8            /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P8               (_U(0x1) << GPIO_ODERC_P8_Pos)
#define GPIO_ODERC_P9_Pos           9            /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P9               (_U(0x1) << GPIO_ODERC_P9_Pos)
#define GPIO_ODERC_P10_Pos          10           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P10              (_U(0x1) << GPIO_ODERC_P10_Pos)
#define GPIO_ODERC_P11_Pos          11           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P11              (_U(0x1) << GPIO_ODERC_P11_Pos)
#define GPIO_ODERC_P12_Pos          12           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P12              (_U(0x1) << GPIO_ODERC_P12_Pos)
#define GPIO_ODERC_P13_Pos          13           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P13              (_U(0x1) << GPIO_ODERC_P13_Pos)
#define GPIO_ODERC_P14_Pos          14           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P14              (_U(0x1) << GPIO_ODERC_P14_Pos)
#define GPIO_ODERC_P15_Pos          15           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P15              (_U(0x1) << GPIO_ODERC_P15_Pos)
#define GPIO_ODERC_P16_Pos          16           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P16              (_U(0x1) << GPIO_ODERC_P16_Pos)
#define GPIO_ODERC_P17_Pos          17           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P17              (_U(0x1) << GPIO_ODERC_P17_Pos)
#define GPIO_ODERC_P18_Pos          18           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P18              (_U(0x1) << GPIO_ODERC_P18_Pos)
#define GPIO_ODERC_P19_Pos          19           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P19              (_U(0x1) << GPIO_ODERC_P19_Pos)
#define GPIO_ODERC_P20_Pos          20           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P20              (_U(0x1) << GPIO_ODERC_P20_Pos)
#define GPIO_ODERC_P21_Pos          21           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P21              (_U(0x1) << GPIO_ODERC_P21_Pos)
#define GPIO_ODERC_P22_Pos          22           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P22              (_U(0x1) << GPIO_ODERC_P22_Pos)
#define GPIO_ODERC_P23_Pos          23           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P23              (_U(0x1) << GPIO_ODERC_P23_Pos)
#define GPIO_ODERC_P24_Pos          24           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P24              (_U(0x1) << GPIO_ODERC_P24_Pos)
#define GPIO_ODERC_P25_Pos          25           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P25              (_U(0x1) << GPIO_ODERC_P25_Pos)
#define GPIO_ODERC_P26_Pos          26           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P26              (_U(0x1) << GPIO_ODERC_P26_Pos)
#define GPIO_ODERC_P27_Pos          27           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P27              (_U(0x1) << GPIO_ODERC_P27_Pos)
#define GPIO_ODERC_P28_Pos          28           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P28              (_U(0x1) << GPIO_ODERC_P28_Pos)
#define GPIO_ODERC_P29_Pos          29           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P29              (_U(0x1) << GPIO_ODERC_P29_Pos)
#define GPIO_ODERC_P30_Pos          30           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P30              (_U(0x1) << GPIO_ODERC_P30_Pos)
#define GPIO_ODERC_P31_Pos          31           /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P31              (_U(0x1) << GPIO_ODERC_P31_Pos)
#define GPIO_ODERC_MASK             _U(0xFFFFFFFF) /**< \brief (GPIO_ODERC) MASK Register */

/* -------- GPIO_ODERT : (GPIO Offset: 0x04C) ( /W 32) port Output Driver Enable Register - Toggle -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t P0:1;             /*!< bit:      0  Output Driver Enable               */
    uint32_t P1:1;             /*!< bit:      1  Output Driver Enable               */
    uint32_t P2:1;             /*!< bit:      2  Output Driver Enable               */
    uint32_t P3:1;             /*!< bit:      3  Output Driver Enable               */
    uint32_t P4:1;             /*!< bit:      4  Output Driver Enable               */
    uint32_t P5:1;             /*!< bit:      5  Output Driver Enable               */
    uint32_t P6:1;             /*!< bit:      6  Output Driver Enable               */
    uint32_t P7:1;             /*!< bit:      7  Output Driver Enable               */
    uint32_t P8:1;             /*!< bit:      8  Output Driver Enable               */
    uint32_t P9:1;             /*!< bit:      9  Output Driver Enable               */
    uint32_t P10:1;            /*!< bit:     10  Output Driver Enable               */
    uint32_t P11:1;            /*!< bit:     11  Output Driver Enable               */
    uint32_t P12:1;            /*!< bit:     12  Output Driver Enable               */
    uint32_t P13:1;            /*!< bit:     13  Output Driver Enable               */
    uint32_t P14:1;            /*!< bit:     14  Output Driver Enable               */
    uint32_t P15:1;            /*!< bit:     15  Output Driver Enable               */
    uint32_t P16:1;            /*!< bit:     16  Output Driver Enable               */
    uint32_t P17:1;            /*!< bit:     17  Output Driver Enable               */
    uint32_t P18:1;            /*!< bit:     18  Output Driver Enable               */
    uint32_t P19:1;            /*!< bit:     19  Output Driver Enable               */
    uint32_t P20:1;            /*!< bit:     20  Output Driver Enable               */
    uint32_t P21:1;            /*!< bit:     21  Output Driver Enable               */
    uint32_t P22:1;            /*!< bit:     22  Output Driver Enable               */
    uint32_t P23:1;            /*!< bit:     23  Output Driver Enable               */
    uint32_t P24:1;            /*!< bit:     24  Output Driver Enable               */
    uint32_t P25:1;            /*!< bit:     25  Output Driver Enable               */
    uint32_t P26:1;            /*!< bit:     26  Output Driver Enable               */
    uint32_t P27:1;            /*!< bit:     27  Output Driver Enable               */
    uint32_t P28:1;            /*!< bit:     28  Output Driver Enable               */
    uint32_t P29:1;            /*!< bit:     29  Output Driver Enable               */
    uint32_t P30:1;            /*!< bit:     30  Output Driver Enable               */
    uint32_t P31:1;            /*!< bit:     31  Output Driver Enable               */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} GPIO_ODERT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_ODERT_OFFSET           0x04C        /**< \brief (GPIO_ODERT offset) Output Driver Enable Register - Toggle */

