frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/gpio.h
/* -------- GPIO_PVR : (GPIO Offset: 0x060) (R/  32) port Pin Value Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t P0:1;             /*!< bit:      0  Pin Value                          */
    uint32_t P1:1;             /*!< bit:      1  Pin Value                          */
    uint32_t P2:1;             /*!< bit:      2  Pin Value                          */
    uint32_t P3:1;             /*!< bit:      3  Pin Value                          */
    uint32_t P4:1;             /*!< bit:      4  Pin Value                          */
    uint32_t P5:1;             /*!< bit:      5  Pin Value                          */
    uint32_t P6:1;             /*!< bit:      6  Pin Value                          */
    uint32_t P7:1;             /*!< bit:      7  Pin Value                          */
    uint32_t P8:1;             /*!< bit:      8  Pin Value                          */
    uint32_t P9:1;             /*!< bit:      9  Pin Value                          */
    uint32_t P10:1;            /*!< bit:     10  Pin Value                          */
    uint32_t P11:1;            /*!< bit:     11  Pin Value                          */
    uint32_t P12:1;            /*!< bit:     12  Pin Value                          */
    uint32_t P13:1;            /*!< bit:     13  Pin Value                          */
    uint32_t P14:1;            /*!< bit:     14  Pin Value                          */
    uint32_t P15:1;            /*!< bit:     15  Pin Value                          */
    uint32_t P16:1;            /*!< bit:     16  Pin Value                          */
    uint32_t P17:1;            /*!< bit:     17  Pin Value                          */
    uint32_t P18:1;            /*!< bit:     18  Pin Value                          */
    uint32_t P19:1;            /*!< bit:     19  Pin Value                          */
    uint32_t P20:1;            /*!< bit:     20  Pin Value                          */
    uint32_t P21:1;            /*!< bit:     21  Pin Value                          */
    uint32_t P22:1;            /*!< bit:     22  Pin Value                          */
    uint32_t P23:1;            /*!< bit:     23  Pin Value                          */
    uint32_t P24:1;            /*!< bit:     24  Pin Value                          */
    uint32_t P25:1;            /*!< bit:     25  Pin Value                          */
    uint32_t P26:1;            /*!< bit:     26  Pin Value                          */
    uint32_t P27:1;            /*!< bit:     27  Pin Value                          */
    uint32_t P28:1;            /*!< bit:     28  Pin Value                          */
    uint32_t P29:1;            /*!< bit:     29  Pin Value                          */
    uint32_t P30:1;            /*!< bit:     30  Pin Value                          */
    uint32_t P31:1;            /*!< bit:     31  Pin Value                          */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} GPIO_PVR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_PVR_OFFSET             0x060        /**< \brief (GPIO_PVR offset) Pin Value Register */

#define GPIO_PVR_P0_Pos             0            /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P0                 (_U(0x1) << GPIO_PVR_P0_Pos)
#define GPIO_PVR_P1_Pos             1            /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P1                 (_U(0x1) << GPIO_PVR_P1_Pos)
#define GPIO_PVR_P2_Pos             2            /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P2                 (_U(0x1) << GPIO_PVR_P2_Pos)
#define GPIO_PVR_P3_Pos             3            /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P3                 (_U(0x1) << GPIO_PVR_P3_Pos)
#define GPIO_PVR_P4_Pos             4            /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P4                 (_U(0x1) << GPIO_PVR_P4_Pos)
#define GPIO_PVR_P5_Pos             5            /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P5                 (_U(0x1) << GPIO_PVR_P5_Pos)
#define GPIO_PVR_P6_Pos             6            /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P6                 (_U(0x1) << GPIO_PVR_P6_Pos)
#define GPIO_PVR_P7_Pos             7            /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P7                 (_U(0x1) << GPIO_PVR_P7_Pos)
#define GPIO_PVR_P8_Pos             8            /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P8                 (_U(0x1) << GPIO_PVR_P8_Pos)
#define GPIO_PVR_P9_Pos             9            /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P9                 (_U(0x1) << GPIO_PVR_P9_Pos)
#define GPIO_PVR_P10_Pos            10           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P10                (_U(0x1) << GPIO_PVR_P10_Pos)
#define GPIO_PVR_P11_Pos            11           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P11                (_U(0x1) << GPIO_PVR_P11_Pos)
#define GPIO_PVR_P12_Pos            12           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P12                (_U(0x1) << GPIO_PVR_P12_Pos)
#define GPIO_PVR_P13_Pos            13           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P13                (_U(0x1) << GPIO_PVR_P13_Pos)
#define GPIO_PVR_P14_Pos            14           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P14                (_U(0x1) << GPIO_PVR_P14_Pos)
#define GPIO_PVR_P15_Pos            15           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P15                (_U(0x1) << GPIO_PVR_P15_Pos)
#define GPIO_PVR_P16_Pos            16           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P16                (_U(0x1) << GPIO_PVR_P16_Pos)
#define GPIO_PVR_P17_Pos            17           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P17                (_U(0x1) << GPIO_PVR_P17_Pos)
#define GPIO_PVR_P18_Pos            18           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P18                (_U(0x1) << GPIO_PVR_P18_Pos)
#define GPIO_PVR_P19_Pos            19           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P19                (_U(0x1) << GPIO_PVR_P19_Pos)
#define GPIO_PVR_P20_Pos            20           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P20                (_U(0x1) << GPIO_PVR_P20_Pos)
#define GPIO_PVR_P21_Pos            21           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P21                (_U(0x1) << GPIO_PVR_P21_Pos)
#define GPIO_PVR_P22_Pos            22           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P22                (_U(0x1) << GPIO_PVR_P22_Pos)
#define GPIO_PVR_P23_Pos            23           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P23                (_U(0x1) << GPIO_PVR_P23_Pos)
#define GPIO_PVR_P24_Pos            24           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P24                (_U(0x1) << GPIO_PVR_P24_Pos)
#define GPIO_PVR_P25_Pos            25           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P25                (_U(0x1) << GPIO_PVR_P25_Pos)
#define GPIO_PVR_P26_Pos            26           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P26                (_U(0x1) << GPIO_PVR_P26_Pos)
#define GPIO_PVR_P27_Pos            27           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P27                (_U(0x1) << GPIO_PVR_P27_Pos)
#define GPIO_PVR_P28_Pos            28           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P28                (_U(0x1) << GPIO_PVR_P28_Pos)
#define GPIO_PVR_P29_Pos            29           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P29                (_U(0x1) << GPIO_PVR_P29_Pos)
#define GPIO_PVR_P30_Pos            30           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P30                (_U(0x1) << GPIO_PVR_P30_Pos)
#define GPIO_PVR_P31_Pos            31           /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P31                (_U(0x1) << GPIO_PVR_P31_Pos)
#define GPIO_PVR_MASK               _U(0xFFFFFFFF) /**< \brief (GPIO_PVR) MASK Register */

/* -------- GPIO_PUER : (GPIO Offset: 0x070) (R/W 32) port Pull-up Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t P0:1;             /*!< bit:      0  Pull-up Enable                     */
    uint32_t P1:1;             /*!< bit:      1  Pull-up Enable                     */
    uint32_t P2:1;             /*!< bit:      2  Pull-up Enable                     */
    uint32_t P3:1;             /*!< bit:      3  Pull-up Enable                     */
    uint32_t P4:1;             /*!< bit:      4  Pull-up Enable                     */
    uint32_t P5:1;             /*!< bit:      5  Pull-up Enable                     */
    uint32_t P6:1;             /*!< bit:      6  Pull-up Enable                     */
    uint32_t P7:1;             /*!< bit:      7  Pull-up Enable                     */
    uint32_t P8:1;             /*!< bit:      8  Pull-up Enable                     */
    uint32_t P9:1;             /*!< bit:      9  Pull-up Enable                     */
    uint32_t P10:1;            /*!< bit:     10  Pull-up Enable                     */
    uint32_t P11:1;            /*!< bit:     11  Pull-up Enable                     */
    uint32_t P12:1;            /*!< bit:     12  Pull-up Enable                     */
    uint32_t P13:1;            /*!< bit:     13  Pull-up Enable                     */
    uint32_t P14:1;            /*!< bit:     14  Pull-up Enable                     */
    uint32_t P15:1;            /*!< bit:     15  Pull-up Enable                     */
    uint32_t P16:1;            /*!< bit:     16  Pull-up Enable                     */
    uint32_t P17:1;            /*!< bit:     17  Pull-up Enable                     */
    uint32_t P18:1;            /*!< bit:     18  Pull-up Enable                     */
    uint32_t P19:1;            /*!< bit:     19  Pull-up Enable                     */
    uint32_t P20:1;            /*!< bit:     20  Pull-up Enable                     */
    uint32_t P21:1;            /*!< bit:     21  Pull-up Enable                     */
    uint32_t P22:1;            /*!< bit:     22  Pull-up Enable                     */
    uint32_t P23:1;            /*!< bit:     23  Pull-up Enable                     */
    uint32_t P24:1;            /*!< bit:     24  Pull-up Enable                     */
    uint32_t P25:1;            /*!< bit:     25  Pull-up Enable                     */
    uint32_t P26:1;            /*!< bit:     26  Pull-up Enable                     */
    uint32_t P27:1;            /*!< bit:     27  Pull-up Enable                     */
    uint32_t P28:1;            /*!< bit:     28  Pull-up Enable                     */
    uint32_t P29:1;            /*!< bit:     29  Pull-up Enable                     */
    uint32_t P30:1;            /*!< bit:     30  Pull-up Enable                     */
    uint32_t P31:1;            /*!< bit:     31  Pull-up Enable                     */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} GPIO_PUER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_PUER_OFFSET            0x070        /**< \brief (GPIO_PUER offset) Pull-up Enable Register */

#define GPIO_PUER_P0_Pos            0            /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P0                (_U(0x1) << GPIO_PUER_P0_Pos)
#define GPIO_PUER_P1_Pos            1            /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P1                (_U(0x1) << GPIO_PUER_P1_Pos)
#define GPIO_PUER_P2_Pos            2            /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P2                (_U(0x1) << GPIO_PUER_P2_Pos)
#define GPIO_PUER_P3_Pos            3            /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P3                (_U(0x1) << GPIO_PUER_P3_Pos)
#define GPIO_PUER_P4_Pos            4            /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P4                (_U(0x1) << GPIO_PUER_P4_Pos)
#define GPIO_PUER_P5_Pos            5            /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P5                (_U(0x1) << GPIO_PUER_P5_Pos)
#define GPIO_PUER_P6_Pos            6            /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P6                (_U(0x1) << GPIO_PUER_P6_Pos)
#define GPIO_PUER_P7_Pos            7            /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P7                (_U(0x1) << GPIO_PUER_P7_Pos)
#define GPIO_PUER_P8_Pos            8            /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P8                (_U(0x1) << GPIO_PUER_P8_Pos)
#define GPIO_PUER_P9_Pos            9            /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P9                (_U(0x1) << GPIO_PUER_P9_Pos)
#define GPIO_PUER_P10_Pos           10           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P10               (_U(0x1) << GPIO_PUER_P10_Pos)
#define GPIO_PUER_P11_Pos           11           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P11               (_U(0x1) << GPIO_PUER_P11_Pos)
#define GPIO_PUER_P12_Pos           12           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P12               (_U(0x1) << GPIO_PUER_P12_Pos)
#define GPIO_PUER_P13_Pos           13           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P13               (_U(0x1) << GPIO_PUER_P13_Pos)
#define GPIO_PUER_P14_Pos           14           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P14               (_U(0x1) << GPIO_PUER_P14_Pos)
#define GPIO_PUER_P15_Pos           15           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P15               (_U(0x1) << GPIO_PUER_P15_Pos)
#define GPIO_PUER_P16_Pos           16           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P16               (_U(0x1) << GPIO_PUER_P16_Pos)
#define GPIO_PUER_P17_Pos           17           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P17               (_U(0x1) << GPIO_PUER_P17_Pos)
#define GPIO_PUER_P18_Pos           18           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P18               (_U(0x1) << GPIO_PUER_P18_Pos)
#define GPIO_PUER_P19_Pos           19           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P19               (_U(0x1) << GPIO_PUER_P19_Pos)
#define GPIO_PUER_P20_Pos           20           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P20               (_U(0x1) << GPIO_PUER_P20_Pos)
#define GPIO_PUER_P21_Pos           21           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P21               (_U(0x1) << GPIO_PUER_P21_Pos)
#define GPIO_PUER_P22_Pos           22           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P22               (_U(0x1) << GPIO_PUER_P22_Pos)
#define GPIO_PUER_P23_Pos           23           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P23               (_U(0x1) << GPIO_PUER_P23_Pos)
#define GPIO_PUER_P24_Pos           24           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P24               (_U(0x1) << GPIO_PUER_P24_Pos)
#define GPIO_PUER_P25_Pos           25           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P25               (_U(0x1) << GPIO_PUER_P25_Pos)
#define GPIO_PUER_P26_Pos           26           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P26               (_U(0x1) << GPIO_PUER_P26_Pos)
#define GPIO_PUER_P27_Pos           27           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P27               (_U(0x1) << GPIO_PUER_P27_Pos)
#define GPIO_PUER_P28_Pos           28           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P28               (_U(0x1) << GPIO_PUER_P28_Pos)
#define GPIO_PUER_P29_Pos           29           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P29               (_U(0x1) << GPIO_PUER_P29_Pos)
#define GPIO_PUER_P30_Pos           30           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P30               (_U(0x1) << GPIO_PUER_P30_Pos)
#define GPIO_PUER_P31_Pos           31           /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P31               (_U(0x1) << GPIO_PUER_P31_Pos)
#define GPIO_PUER_MASK              _U(0xFFFFFFFF) /**< \brief (GPIO_PUER) MASK Register */

/* -------- GPIO_PUERS : (GPIO Offset: 0x074) ( /W 32) port Pull-up Enable Register - Set -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t P0:1;             /*!< bit:      0  Pull-up Enable                     */
    uint32_t P1:1;             /*!< bit:      1  Pull-up Enable                     */
    uint32_t P2:1;             /*!< bit:      2  Pull-up Enable                     */
    uint32_t P3:1;             /*!< bit:      3  Pull-up Enable                     */
    uint32_t P4:1;             /*!< bit:      4  Pull-up Enable                     */
    uint32_t P5:1;             /*!< bit:      5  Pull-up Enable                     */
    uint32_t P6:1;             /*!< bit:      6  Pull-up Enable                     */
    uint32_t P7:1;             /*!< bit:      7  Pull-up Enable                     */
    uint32_t P8:1;             /*!< bit:      8  Pull-up Enable                     */
    uint32_t P9:1;             /*!< bit:      9  Pull-up Enable                     */
    uint32_t P10:1;            /*!< bit:     10  Pull-up Enable                     */
    uint32_t P11:1;            /*!< bit:     11  Pull-up Enable                     */
    uint32_t P12:1;            /*!< bit:     12  Pull-up Enable                     */
    uint32_t P13:1;            /*!< bit:     13  Pull-up Enable                     */
    uint32_t P14:1;            /*!< bit:     14  Pull-up Enable                     */
    uint32_t P15:1;            /*!< bit:     15  Pull-up Enable                     */
    uint32_t P16:1;            /*!< bit:     16  Pull-up Enable                     */
    uint32_t P17:1;            /*!< bit:     17  Pull-up Enable                     */
    uint32_t P18:1;            /*!< bit:     18  Pull-up Enable                     */
    uint32_t P19:1;            /*!< bit:     19  Pull-up Enable                     */
    uint32_t P20:1;            /*!< bit:     20  Pull-up Enable                     */
    uint32_t P21:1;            /*!< bit:     21  Pull-up Enable                     */
    uint32_t P22:1;            /*!< bit:     22  Pull-up Enable                     */
    uint32_t P23:1;            /*!< bit:     23  Pull-up Enable                     */
    uint32_t P24:1;            /*!< bit:     24  Pull-up Enable                     */
    uint32_t P25:1;            /*!< bit:     25  Pull-up Enable                     */
    uint32_t P26:1;            /*!< bit:     26  Pull-up Enable                     */
    uint32_t P27:1;            /*!< bit:     27  Pull-up Enable                     */
    uint32_t P28:1;            /*!< bit:     28  Pull-up Enable                     */
    uint32_t P29:1;            /*!< bit:     29  Pull-up Enable                     */
    uint32_t P30:1;            /*!< bit:     30  Pull-up Enable                     */
    uint32_t P31:1;            /*!< bit:     31  Pull-up Enable                     */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} GPIO_PUERS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_PUERS_OFFSET           0x074        /**< \brief (GPIO_PUERS offset) Pull-up Enable Register - Set */

