frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/gpio.h
#define GPIO_PUERT_P0_Pos           0            /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P0               (_U(0x1) << GPIO_PUERT_P0_Pos)
#define GPIO_PUERT_P1_Pos           1            /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P1               (_U(0x1) << GPIO_PUERT_P1_Pos)
#define GPIO_PUERT_P2_Pos           2            /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P2               (_U(0x1) << GPIO_PUERT_P2_Pos)
#define GPIO_PUERT_P3_Pos           3            /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P3               (_U(0x1) << GPIO_PUERT_P3_Pos)
#define GPIO_PUERT_P4_Pos           4            /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P4               (_U(0x1) << GPIO_PUERT_P4_Pos)
#define GPIO_PUERT_P5_Pos           5            /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P5               (_U(0x1) << GPIO_PUERT_P5_Pos)
#define GPIO_PUERT_P6_Pos           6            /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P6               (_U(0x1) << GPIO_PUERT_P6_Pos)
#define GPIO_PUERT_P7_Pos           7            /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P7               (_U(0x1) << GPIO_PUERT_P7_Pos)
#define GPIO_PUERT_P8_Pos           8            /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P8               (_U(0x1) << GPIO_PUERT_P8_Pos)
#define GPIO_PUERT_P9_Pos           9            /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P9               (_U(0x1) << GPIO_PUERT_P9_Pos)
#define GPIO_PUERT_P10_Pos          10           /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P10              (_U(0x1) << GPIO_PUERT_P10_Pos)
#define GPIO_PUERT_P11_Pos          11           /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P11              (_U(0x1) << GPIO_PUERT_P11_Pos)
#define GPIO_PUERT_P12_Pos          12           /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P12              (_U(0x1) << GPIO_PUERT_P12_Pos)
#define GPIO_PUERT_P13_Pos          13           /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P13              (_U(0x1) << GPIO_PUERT_P13_Pos)
#define GPIO_PUERT_P14_Pos          14           /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P14              (_U(0x1) << GPIO_PUERT_P14_Pos)
#define GPIO_PUERT_P15_Pos          15           /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P15              (_U(0x1) << GPIO_PUERT_P15_Pos)
#define GPIO_PUERT_P16_Pos          16           /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P16              (_U(0x1) << GPIO_PUERT_P16_Pos)
#define GPIO_PUERT_P17_Pos          17           /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P17              (_U(0x1) << GPIO_PUERT_P17_Pos)
#define GPIO_PUERT_P18_Pos          18           /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P18              (_U(0x1) << GPIO_PUERT_P18_Pos)
#define GPIO_PUERT_P19_Pos          19           /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P19              (_U(0x1) << GPIO_PUERT_P19_Pos)
#define GPIO_PUERT_P20_Pos          20           /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P20              (_U(0x1) << GPIO_PUERT_P20_Pos)
#define GPIO_PUERT_P21_Pos          21           /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P21              (_U(0x1) << GPIO_PUERT_P21_Pos)
#define GPIO_PUERT_P22_Pos          22           /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P22              (_U(0x1) << GPIO_PUERT_P22_Pos)
#define GPIO_PUERT_P23_Pos          23           /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P23              (_U(0x1) << GPIO_PUERT_P23_Pos)
#define GPIO_PUERT_P24_Pos          24           /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P24              (_U(0x1) << GPIO_PUERT_P24_Pos)
#define GPIO_PUERT_P25_Pos          25           /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P25              (_U(0x1) << GPIO_PUERT_P25_Pos)
#define GPIO_PUERT_P26_Pos          26           /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P26              (_U(0x1) << GPIO_PUERT_P26_Pos)
#define GPIO_PUERT_P27_Pos          27           /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P27              (_U(0x1) << GPIO_PUERT_P27_Pos)
#define GPIO_PUERT_P28_Pos          28           /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P28              (_U(0x1) << GPIO_PUERT_P28_Pos)
#define GPIO_PUERT_P29_Pos          29           /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P29              (_U(0x1) << GPIO_PUERT_P29_Pos)
#define GPIO_PUERT_P30_Pos          30           /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P30              (_U(0x1) << GPIO_PUERT_P30_Pos)
#define GPIO_PUERT_P31_Pos          31           /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P31              (_U(0x1) << GPIO_PUERT_P31_Pos)
#define GPIO_PUERT_MASK             _U(0xFFFFFFFF) /**< \brief (GPIO_PUERT) MASK Register */

/* -------- GPIO_PDER : (GPIO Offset: 0x080) (R/W 32) port Pull-down Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t P0:1;             /*!< bit:      0  Pull-down Enable                   */
    uint32_t P1:1;             /*!< bit:      1  Pull-down Enable                   */
    uint32_t P2:1;             /*!< bit:      2  Pull-down Enable                   */
    uint32_t P3:1;             /*!< bit:      3  Pull-down Enable                   */
    uint32_t P4:1;             /*!< bit:      4  Pull-down Enable                   */
    uint32_t P5:1;             /*!< bit:      5  Pull-down Enable                   */
    uint32_t P6:1;             /*!< bit:      6  Pull-down Enable                   */
    uint32_t P7:1;             /*!< bit:      7  Pull-down Enable                   */
    uint32_t P8:1;             /*!< bit:      8  Pull-down Enable                   */
    uint32_t P9:1;             /*!< bit:      9  Pull-down Enable                   */
    uint32_t P10:1;            /*!< bit:     10  Pull-down Enable                   */
    uint32_t P11:1;            /*!< bit:     11  Pull-down Enable                   */
    uint32_t P12:1;            /*!< bit:     12  Pull-down Enable                   */
    uint32_t P13:1;            /*!< bit:     13  Pull-down Enable                   */
    uint32_t P14:1;            /*!< bit:     14  Pull-down Enable                   */
    uint32_t P15:1;            /*!< bit:     15  Pull-down Enable                   */
    uint32_t P16:1;            /*!< bit:     16  Pull-down Enable                   */
    uint32_t P17:1;            /*!< bit:     17  Pull-down Enable                   */
    uint32_t P18:1;            /*!< bit:     18  Pull-down Enable                   */
    uint32_t P19:1;            /*!< bit:     19  Pull-down Enable                   */
    uint32_t P20:1;            /*!< bit:     20  Pull-down Enable                   */
    uint32_t P21:1;            /*!< bit:     21  Pull-down Enable                   */
    uint32_t P22:1;            /*!< bit:     22  Pull-down Enable                   */
    uint32_t P23:1;            /*!< bit:     23  Pull-down Enable                   */
    uint32_t P24:1;            /*!< bit:     24  Pull-down Enable                   */
    uint32_t P25:1;            /*!< bit:     25  Pull-down Enable                   */
    uint32_t P26:1;            /*!< bit:     26  Pull-down Enable                   */
    uint32_t P27:1;            /*!< bit:     27  Pull-down Enable                   */
    uint32_t P28:1;            /*!< bit:     28  Pull-down Enable                   */
    uint32_t P29:1;            /*!< bit:     29  Pull-down Enable                   */
    uint32_t P30:1;            /*!< bit:     30  Pull-down Enable                   */
    uint32_t P31:1;            /*!< bit:     31  Pull-down Enable                   */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} GPIO_PDER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_PDER_OFFSET            0x080        /**< \brief (GPIO_PDER offset) Pull-down Enable Register */

