frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/gpio.h
/* -------- GPIO_IERT : (GPIO Offset: 0x09C) ( /W 32) port Interrupt Enable Register - Toggle -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t P0:1;             /*!< bit:      0  Interrupt Enable                   */
    uint32_t P1:1;             /*!< bit:      1  Interrupt Enable                   */
    uint32_t P2:1;             /*!< bit:      2  Interrupt Enable                   */
    uint32_t P3:1;             /*!< bit:      3  Interrupt Enable                   */
    uint32_t P4:1;             /*!< bit:      4  Interrupt Enable                   */
    uint32_t P5:1;             /*!< bit:      5  Interrupt Enable                   */
    uint32_t P6:1;             /*!< bit:      6  Interrupt Enable                   */
    uint32_t P7:1;             /*!< bit:      7  Interrupt Enable                   */
    uint32_t P8:1;             /*!< bit:      8  Interrupt Enable                   */
    uint32_t P9:1;             /*!< bit:      9  Interrupt Enable                   */
    uint32_t P10:1;            /*!< bit:     10  Interrupt Enable                   */
    uint32_t P11:1;            /*!< bit:     11  Interrupt Enable                   */
    uint32_t P12:1;            /*!< bit:     12  Interrupt Enable                   */
    uint32_t P13:1;            /*!< bit:     13  Interrupt Enable                   */
    uint32_t P14:1;            /*!< bit:     14  Interrupt Enable                   */
    uint32_t P15:1;            /*!< bit:     15  Interrupt Enable                   */
    uint32_t P16:1;            /*!< bit:     16  Interrupt Enable                   */
    uint32_t P17:1;            /*!< bit:     17  Interrupt Enable                   */
    uint32_t P18:1;            /*!< bit:     18  Interrupt Enable                   */
    uint32_t P19:1;            /*!< bit:     19  Interrupt Enable                   */
    uint32_t P20:1;            /*!< bit:     20  Interrupt Enable                   */
    uint32_t P21:1;            /*!< bit:     21  Interrupt Enable                   */
    uint32_t P22:1;            /*!< bit:     22  Interrupt Enable                   */
    uint32_t P23:1;            /*!< bit:     23  Interrupt Enable                   */
    uint32_t P24:1;            /*!< bit:     24  Interrupt Enable                   */
    uint32_t P25:1;            /*!< bit:     25  Interrupt Enable                   */
    uint32_t P26:1;            /*!< bit:     26  Interrupt Enable                   */
    uint32_t P27:1;            /*!< bit:     27  Interrupt Enable                   */
    uint32_t P28:1;            /*!< bit:     28  Interrupt Enable                   */
    uint32_t P29:1;            /*!< bit:     29  Interrupt Enable                   */
    uint32_t P30:1;            /*!< bit:     30  Interrupt Enable                   */
    uint32_t P31:1;            /*!< bit:     31  Interrupt Enable                   */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} GPIO_IERT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_IERT_OFFSET            0x09C        /**< \brief (GPIO_IERT offset) Interrupt Enable Register - Toggle */

#define GPIO_IERT_P0_Pos            0            /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P0                (_U(0x1) << GPIO_IERT_P0_Pos)
#define GPIO_IERT_P1_Pos            1            /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P1                (_U(0x1) << GPIO_IERT_P1_Pos)
#define GPIO_IERT_P2_Pos            2            /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P2                (_U(0x1) << GPIO_IERT_P2_Pos)
#define GPIO_IERT_P3_Pos            3            /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P3                (_U(0x1) << GPIO_IERT_P3_Pos)
#define GPIO_IERT_P4_Pos            4            /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P4                (_U(0x1) << GPIO_IERT_P4_Pos)
#define GPIO_IERT_P5_Pos            5            /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P5                (_U(0x1) << GPIO_IERT_P5_Pos)
#define GPIO_IERT_P6_Pos            6            /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P6                (_U(0x1) << GPIO_IERT_P6_Pos)
#define GPIO_IERT_P7_Pos            7            /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P7                (_U(0x1) << GPIO_IERT_P7_Pos)
#define GPIO_IERT_P8_Pos            8            /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P8                (_U(0x1) << GPIO_IERT_P8_Pos)
#define GPIO_IERT_P9_Pos            9            /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P9                (_U(0x1) << GPIO_IERT_P9_Pos)
#define GPIO_IERT_P10_Pos           10           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P10               (_U(0x1) << GPIO_IERT_P10_Pos)
#define GPIO_IERT_P11_Pos           11           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P11               (_U(0x1) << GPIO_IERT_P11_Pos)
#define GPIO_IERT_P12_Pos           12           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P12               (_U(0x1) << GPIO_IERT_P12_Pos)
#define GPIO_IERT_P13_Pos           13           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P13               (_U(0x1) << GPIO_IERT_P13_Pos)
#define GPIO_IERT_P14_Pos           14           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P14               (_U(0x1) << GPIO_IERT_P14_Pos)
#define GPIO_IERT_P15_Pos           15           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P15               (_U(0x1) << GPIO_IERT_P15_Pos)
#define GPIO_IERT_P16_Pos           16           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P16               (_U(0x1) << GPIO_IERT_P16_Pos)
#define GPIO_IERT_P17_Pos           17           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P17               (_U(0x1) << GPIO_IERT_P17_Pos)
#define GPIO_IERT_P18_Pos           18           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P18               (_U(0x1) << GPIO_IERT_P18_Pos)
#define GPIO_IERT_P19_Pos           19           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P19               (_U(0x1) << GPIO_IERT_P19_Pos)
#define GPIO_IERT_P20_Pos           20           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P20               (_U(0x1) << GPIO_IERT_P20_Pos)
#define GPIO_IERT_P21_Pos           21           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P21               (_U(0x1) << GPIO_IERT_P21_Pos)
#define GPIO_IERT_P22_Pos           22           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P22               (_U(0x1) << GPIO_IERT_P22_Pos)
#define GPIO_IERT_P23_Pos           23           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P23               (_U(0x1) << GPIO_IERT_P23_Pos)
#define GPIO_IERT_P24_Pos           24           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P24               (_U(0x1) << GPIO_IERT_P24_Pos)
#define GPIO_IERT_P25_Pos           25           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P25               (_U(0x1) << GPIO_IERT_P25_Pos)
#define GPIO_IERT_P26_Pos           26           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P26               (_U(0x1) << GPIO_IERT_P26_Pos)
#define GPIO_IERT_P27_Pos           27           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P27               (_U(0x1) << GPIO_IERT_P27_Pos)
#define GPIO_IERT_P28_Pos           28           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P28               (_U(0x1) << GPIO_IERT_P28_Pos)
#define GPIO_IERT_P29_Pos           29           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P29               (_U(0x1) << GPIO_IERT_P29_Pos)
#define GPIO_IERT_P30_Pos           30           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P30               (_U(0x1) << GPIO_IERT_P30_Pos)
#define GPIO_IERT_P31_Pos           31           /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P31               (_U(0x1) << GPIO_IERT_P31_Pos)
#define GPIO_IERT_MASK              _U(0xFFFFFFFF) /**< \brief (GPIO_IERT) MASK Register */

