frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/gpio.h
#define GPIO_OSRR0T_P0_Pos          0            /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P0              (_U(0x1) << GPIO_OSRR0T_P0_Pos)
#define GPIO_OSRR0T_P1_Pos          1            /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P1              (_U(0x1) << GPIO_OSRR0T_P1_Pos)
#define GPIO_OSRR0T_P2_Pos          2            /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P2              (_U(0x1) << GPIO_OSRR0T_P2_Pos)
#define GPIO_OSRR0T_P3_Pos          3            /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P3              (_U(0x1) << GPIO_OSRR0T_P3_Pos)
#define GPIO_OSRR0T_P4_Pos          4            /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P4              (_U(0x1) << GPIO_OSRR0T_P4_Pos)
#define GPIO_OSRR0T_P5_Pos          5            /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P5              (_U(0x1) << GPIO_OSRR0T_P5_Pos)
#define GPIO_OSRR0T_P6_Pos          6            /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P6              (_U(0x1) << GPIO_OSRR0T_P6_Pos)
#define GPIO_OSRR0T_P7_Pos          7            /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P7              (_U(0x1) << GPIO_OSRR0T_P7_Pos)
#define GPIO_OSRR0T_P8_Pos          8            /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P8              (_U(0x1) << GPIO_OSRR0T_P8_Pos)
#define GPIO_OSRR0T_P9_Pos          9            /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P9              (_U(0x1) << GPIO_OSRR0T_P9_Pos)
#define GPIO_OSRR0T_P10_Pos         10           /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P10             (_U(0x1) << GPIO_OSRR0T_P10_Pos)
#define GPIO_OSRR0T_P11_Pos         11           /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P11             (_U(0x1) << GPIO_OSRR0T_P11_Pos)
#define GPIO_OSRR0T_P12_Pos         12           /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P12             (_U(0x1) << GPIO_OSRR0T_P12_Pos)
#define GPIO_OSRR0T_P13_Pos         13           /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P13             (_U(0x1) << GPIO_OSRR0T_P13_Pos)
#define GPIO_OSRR0T_P14_Pos         14           /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P14             (_U(0x1) << GPIO_OSRR0T_P14_Pos)
#define GPIO_OSRR0T_P15_Pos         15           /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P15             (_U(0x1) << GPIO_OSRR0T_P15_Pos)
#define GPIO_OSRR0T_P16_Pos         16           /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P16             (_U(0x1) << GPIO_OSRR0T_P16_Pos)
#define GPIO_OSRR0T_P17_Pos         17           /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P17             (_U(0x1) << GPIO_OSRR0T_P17_Pos)
#define GPIO_OSRR0T_P18_Pos         18           /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P18             (_U(0x1) << GPIO_OSRR0T_P18_Pos)
#define GPIO_OSRR0T_P19_Pos         19           /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P19             (_U(0x1) << GPIO_OSRR0T_P19_Pos)
#define GPIO_OSRR0T_P20_Pos         20           /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P20             (_U(0x1) << GPIO_OSRR0T_P20_Pos)
#define GPIO_OSRR0T_P21_Pos         21           /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P21             (_U(0x1) << GPIO_OSRR0T_P21_Pos)
#define GPIO_OSRR0T_P22_Pos         22           /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P22             (_U(0x1) << GPIO_OSRR0T_P22_Pos)
#define GPIO_OSRR0T_P23_Pos         23           /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P23             (_U(0x1) << GPIO_OSRR0T_P23_Pos)
#define GPIO_OSRR0T_P24_Pos         24           /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P24             (_U(0x1) << GPIO_OSRR0T_P24_Pos)
#define GPIO_OSRR0T_P25_Pos         25           /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P25             (_U(0x1) << GPIO_OSRR0T_P25_Pos)
#define GPIO_OSRR0T_P26_Pos         26           /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P26             (_U(0x1) << GPIO_OSRR0T_P26_Pos)
#define GPIO_OSRR0T_P27_Pos         27           /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P27             (_U(0x1) << GPIO_OSRR0T_P27_Pos)
#define GPIO_OSRR0T_P28_Pos         28           /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P28             (_U(0x1) << GPIO_OSRR0T_P28_Pos)
#define GPIO_OSRR0T_P29_Pos         29           /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P29             (_U(0x1) << GPIO_OSRR0T_P29_Pos)
#define GPIO_OSRR0T_P30_Pos         30           /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P30             (_U(0x1) << GPIO_OSRR0T_P30_Pos)
#define GPIO_OSRR0T_P31_Pos         31           /**< \brief (GPIO_OSRR0T) Output Slew Rate Control Enable */
#define GPIO_OSRR0T_P31             (_U(0x1) << GPIO_OSRR0T_P31_Pos)
#define GPIO_OSRR0T_MASK            _U(0xFFFFFFFF) /**< \brief (GPIO_OSRR0T) MASK Register */

/* -------- GPIO_STER : (GPIO Offset: 0x160) (R/W 32) port Schmitt Trigger Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t P0:1;             /*!< bit:      0  Schmitt Trigger Enable             */
    uint32_t P1:1;             /*!< bit:      1  Schmitt Trigger Enable             */
    uint32_t P2:1;             /*!< bit:      2  Schmitt Trigger Enable             */
    uint32_t P3:1;             /*!< bit:      3  Schmitt Trigger Enable             */
    uint32_t P4:1;             /*!< bit:      4  Schmitt Trigger Enable             */
    uint32_t P5:1;             /*!< bit:      5  Schmitt Trigger Enable             */
    uint32_t P6:1;             /*!< bit:      6  Schmitt Trigger Enable             */
    uint32_t P7:1;             /*!< bit:      7  Schmitt Trigger Enable             */
    uint32_t P8:1;             /*!< bit:      8  Schmitt Trigger Enable             */
    uint32_t P9:1;             /*!< bit:      9  Schmitt Trigger Enable             */
    uint32_t P10:1;            /*!< bit:     10  Schmitt Trigger Enable             */
    uint32_t P11:1;            /*!< bit:     11  Schmitt Trigger Enable             */
    uint32_t P12:1;            /*!< bit:     12  Schmitt Trigger Enable             */
    uint32_t P13:1;            /*!< bit:     13  Schmitt Trigger Enable             */
    uint32_t P14:1;            /*!< bit:     14  Schmitt Trigger Enable             */
    uint32_t P15:1;            /*!< bit:     15  Schmitt Trigger Enable             */
    uint32_t P16:1;            /*!< bit:     16  Schmitt Trigger Enable             */
    uint32_t P17:1;            /*!< bit:     17  Schmitt Trigger Enable             */
    uint32_t P18:1;            /*!< bit:     18  Schmitt Trigger Enable             */
    uint32_t P19:1;            /*!< bit:     19  Schmitt Trigger Enable             */
    uint32_t P20:1;            /*!< bit:     20  Schmitt Trigger Enable             */
    uint32_t P21:1;            /*!< bit:     21  Schmitt Trigger Enable             */
    uint32_t P22:1;            /*!< bit:     22  Schmitt Trigger Enable             */
    uint32_t P23:1;            /*!< bit:     23  Schmitt Trigger Enable             */
    uint32_t P24:1;            /*!< bit:     24  Schmitt Trigger Enable             */
    uint32_t P25:1;            /*!< bit:     25  Schmitt Trigger Enable             */
    uint32_t P26:1;            /*!< bit:     26  Schmitt Trigger Enable             */
    uint32_t P27:1;            /*!< bit:     27  Schmitt Trigger Enable             */
    uint32_t P28:1;            /*!< bit:     28  Schmitt Trigger Enable             */
    uint32_t P29:1;            /*!< bit:     29  Schmitt Trigger Enable             */
    uint32_t P30:1;            /*!< bit:     30  Schmitt Trigger Enable             */
    uint32_t P31:1;            /*!< bit:     31  Schmitt Trigger Enable             */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} GPIO_STER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_STER_OFFSET            0x160        /**< \brief (GPIO_STER offset) Schmitt Trigger Enable Register */

#define GPIO_STER_P0_Pos            0            /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P0                (_U(0x1) << GPIO_STER_P0_Pos)
#define GPIO_STER_P1_Pos            1            /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P1                (_U(0x1) << GPIO_STER_P1_Pos)
#define GPIO_STER_P2_Pos            2            /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P2                (_U(0x1) << GPIO_STER_P2_Pos)
#define GPIO_STER_P3_Pos            3            /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P3                (_U(0x1) << GPIO_STER_P3_Pos)
#define GPIO_STER_P4_Pos            4            /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P4                (_U(0x1) << GPIO_STER_P4_Pos)
#define GPIO_STER_P5_Pos            5            /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P5                (_U(0x1) << GPIO_STER_P5_Pos)
#define GPIO_STER_P6_Pos            6            /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P6                (_U(0x1) << GPIO_STER_P6_Pos)
#define GPIO_STER_P7_Pos            7            /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P7                (_U(0x1) << GPIO_STER_P7_Pos)
#define GPIO_STER_P8_Pos            8            /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P8                (_U(0x1) << GPIO_STER_P8_Pos)
#define GPIO_STER_P9_Pos            9            /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P9                (_U(0x1) << GPIO_STER_P9_Pos)
#define GPIO_STER_P10_Pos           10           /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P10               (_U(0x1) << GPIO_STER_P10_Pos)
#define GPIO_STER_P11_Pos           11           /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P11               (_U(0x1) << GPIO_STER_P11_Pos)
#define GPIO_STER_P12_Pos           12           /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P12               (_U(0x1) << GPIO_STER_P12_Pos)
#define GPIO_STER_P13_Pos           13           /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P13               (_U(0x1) << GPIO_STER_P13_Pos)
#define GPIO_STER_P14_Pos           14           /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P14               (_U(0x1) << GPIO_STER_P14_Pos)
#define GPIO_STER_P15_Pos           15           /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P15               (_U(0x1) << GPIO_STER_P15_Pos)
#define GPIO_STER_P16_Pos           16           /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P16               (_U(0x1) << GPIO_STER_P16_Pos)
#define GPIO_STER_P17_Pos           17           /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P17               (_U(0x1) << GPIO_STER_P17_Pos)
#define GPIO_STER_P18_Pos           18           /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P18               (_U(0x1) << GPIO_STER_P18_Pos)
#define GPIO_STER_P19_Pos           19           /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P19               (_U(0x1) << GPIO_STER_P19_Pos)
#define GPIO_STER_P20_Pos           20           /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P20               (_U(0x1) << GPIO_STER_P20_Pos)
#define GPIO_STER_P21_Pos           21           /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P21               (_U(0x1) << GPIO_STER_P21_Pos)
#define GPIO_STER_P22_Pos           22           /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P22               (_U(0x1) << GPIO_STER_P22_Pos)
#define GPIO_STER_P23_Pos           23           /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P23               (_U(0x1) << GPIO_STER_P23_Pos)
#define GPIO_STER_P24_Pos           24           /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P24               (_U(0x1) << GPIO_STER_P24_Pos)
#define GPIO_STER_P25_Pos           25           /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P25               (_U(0x1) << GPIO_STER_P25_Pos)
#define GPIO_STER_P26_Pos           26           /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P26               (_U(0x1) << GPIO_STER_P26_Pos)
#define GPIO_STER_P27_Pos           27           /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P27               (_U(0x1) << GPIO_STER_P27_Pos)
#define GPIO_STER_P28_Pos           28           /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P28               (_U(0x1) << GPIO_STER_P28_Pos)
#define GPIO_STER_P29_Pos           29           /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P29               (_U(0x1) << GPIO_STER_P29_Pos)
#define GPIO_STER_P30_Pos           30           /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P30               (_U(0x1) << GPIO_STER_P30_Pos)
#define GPIO_STER_P31_Pos           31           /**< \brief (GPIO_STER) Schmitt Trigger Enable */
#define GPIO_STER_P31               (_U(0x1) << GPIO_STER_P31_Pos)
#define GPIO_STER_MASK              _U(0xFFFFFFFF) /**< \brief (GPIO_STER) MASK Register */

/* -------- GPIO_STERS : (GPIO Offset: 0x164) (R/W 32) port Schmitt Trigger Enable Register - Set -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t P0:1;             /*!< bit:      0  Schmitt Trigger Enable             */
    uint32_t P1:1;             /*!< bit:      1  Schmitt Trigger Enable             */
    uint32_t P2:1;             /*!< bit:      2  Schmitt Trigger Enable             */
    uint32_t P3:1;             /*!< bit:      3  Schmitt Trigger Enable             */
    uint32_t P4:1;             /*!< bit:      4  Schmitt Trigger Enable             */
    uint32_t P5:1;             /*!< bit:      5  Schmitt Trigger Enable             */
    uint32_t P6:1;             /*!< bit:      6  Schmitt Trigger Enable             */
    uint32_t P7:1;             /*!< bit:      7  Schmitt Trigger Enable             */
    uint32_t P8:1;             /*!< bit:      8  Schmitt Trigger Enable             */
    uint32_t P9:1;             /*!< bit:      9  Schmitt Trigger Enable             */
    uint32_t P10:1;            /*!< bit:     10  Schmitt Trigger Enable             */
    uint32_t P11:1;            /*!< bit:     11  Schmitt Trigger Enable             */
    uint32_t P12:1;            /*!< bit:     12  Schmitt Trigger Enable             */
    uint32_t P13:1;            /*!< bit:     13  Schmitt Trigger Enable             */
    uint32_t P14:1;            /*!< bit:     14  Schmitt Trigger Enable             */
    uint32_t P15:1;            /*!< bit:     15  Schmitt Trigger Enable             */
    uint32_t P16:1;            /*!< bit:     16  Schmitt Trigger Enable             */
    uint32_t P17:1;            /*!< bit:     17  Schmitt Trigger Enable             */
    uint32_t P18:1;            /*!< bit:     18  Schmitt Trigger Enable             */
    uint32_t P19:1;            /*!< bit:     19  Schmitt Trigger Enable             */
    uint32_t P20:1;            /*!< bit:     20  Schmitt Trigger Enable             */
    uint32_t P21:1;            /*!< bit:     21  Schmitt Trigger Enable             */
    uint32_t P22:1;            /*!< bit:     22  Schmitt Trigger Enable             */
    uint32_t P23:1;            /*!< bit:     23  Schmitt Trigger Enable             */
    uint32_t P24:1;            /*!< bit:     24  Schmitt Trigger Enable             */
    uint32_t P25:1;            /*!< bit:     25  Schmitt Trigger Enable             */
    uint32_t P26:1;            /*!< bit:     26  Schmitt Trigger Enable             */
    uint32_t P27:1;            /*!< bit:     27  Schmitt Trigger Enable             */
    uint32_t P28:1;            /*!< bit:     28  Schmitt Trigger Enable             */
    uint32_t P29:1;            /*!< bit:     29  Schmitt Trigger Enable             */
    uint32_t P30:1;            /*!< bit:     30  Schmitt Trigger Enable             */
    uint32_t P31:1;            /*!< bit:     31  Schmitt Trigger Enable             */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} GPIO_STERS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

