frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/gpio.h
/* -------- GPIO_EVER : (GPIO Offset: 0x180) (R/W 32) port Event Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t P0:1;             /*!< bit:      0  Event Enable                       */
    uint32_t P1:1;             /*!< bit:      1  Event Enable                       */
    uint32_t P2:1;             /*!< bit:      2  Event Enable                       */
    uint32_t P3:1;             /*!< bit:      3  Event Enable                       */
    uint32_t P4:1;             /*!< bit:      4  Event Enable                       */
    uint32_t P5:1;             /*!< bit:      5  Event Enable                       */
    uint32_t P6:1;             /*!< bit:      6  Event Enable                       */
    uint32_t P7:1;             /*!< bit:      7  Event Enable                       */
    uint32_t P8:1;             /*!< bit:      8  Event Enable                       */
    uint32_t P9:1;             /*!< bit:      9  Event Enable                       */
    uint32_t P10:1;            /*!< bit:     10  Event Enable                       */
    uint32_t P11:1;            /*!< bit:     11  Event Enable                       */
    uint32_t P12:1;            /*!< bit:     12  Event Enable                       */
    uint32_t P13:1;            /*!< bit:     13  Event Enable                       */
    uint32_t P14:1;            /*!< bit:     14  Event Enable                       */
    uint32_t P15:1;            /*!< bit:     15  Event Enable                       */
    uint32_t P16:1;            /*!< bit:     16  Event Enable                       */
    uint32_t P17:1;            /*!< bit:     17  Event Enable                       */
    uint32_t P18:1;            /*!< bit:     18  Event Enable                       */
    uint32_t P19:1;            /*!< bit:     19  Event Enable                       */
    uint32_t P20:1;            /*!< bit:     20  Event Enable                       */
    uint32_t P21:1;            /*!< bit:     21  Event Enable                       */
    uint32_t P22:1;            /*!< bit:     22  Event Enable                       */
    uint32_t P23:1;            /*!< bit:     23  Event Enable                       */
    uint32_t P24:1;            /*!< bit:     24  Event Enable                       */
    uint32_t P25:1;            /*!< bit:     25  Event Enable                       */
    uint32_t P26:1;            /*!< bit:     26  Event Enable                       */
    uint32_t P27:1;            /*!< bit:     27  Event Enable                       */
    uint32_t P28:1;            /*!< bit:     28  Event Enable                       */
    uint32_t P29:1;            /*!< bit:     29  Event Enable                       */
    uint32_t P30:1;            /*!< bit:     30  Event Enable                       */
    uint32_t P31:1;            /*!< bit:     31  Event Enable                       */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} GPIO_EVER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_EVER_OFFSET            0x180        /**< \brief (GPIO_EVER offset) Event Enable Register */

#define GPIO_EVER_P0_Pos            0            /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P0                (_U(0x1) << GPIO_EVER_P0_Pos)
#define GPIO_EVER_P1_Pos            1            /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P1                (_U(0x1) << GPIO_EVER_P1_Pos)
#define GPIO_EVER_P2_Pos            2            /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P2                (_U(0x1) << GPIO_EVER_P2_Pos)
#define GPIO_EVER_P3_Pos            3            /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P3                (_U(0x1) << GPIO_EVER_P3_Pos)
#define GPIO_EVER_P4_Pos            4            /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P4                (_U(0x1) << GPIO_EVER_P4_Pos)
#define GPIO_EVER_P5_Pos            5            /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P5                (_U(0x1) << GPIO_EVER_P5_Pos)
#define GPIO_EVER_P6_Pos            6            /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P6                (_U(0x1) << GPIO_EVER_P6_Pos)
#define GPIO_EVER_P7_Pos            7            /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P7                (_U(0x1) << GPIO_EVER_P7_Pos)
#define GPIO_EVER_P8_Pos            8            /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P8                (_U(0x1) << GPIO_EVER_P8_Pos)
#define GPIO_EVER_P9_Pos            9            /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P9                (_U(0x1) << GPIO_EVER_P9_Pos)
#define GPIO_EVER_P10_Pos           10           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P10               (_U(0x1) << GPIO_EVER_P10_Pos)
#define GPIO_EVER_P11_Pos           11           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P11               (_U(0x1) << GPIO_EVER_P11_Pos)
#define GPIO_EVER_P12_Pos           12           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P12               (_U(0x1) << GPIO_EVER_P12_Pos)
#define GPIO_EVER_P13_Pos           13           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P13               (_U(0x1) << GPIO_EVER_P13_Pos)
#define GPIO_EVER_P14_Pos           14           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P14               (_U(0x1) << GPIO_EVER_P14_Pos)
#define GPIO_EVER_P15_Pos           15           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P15               (_U(0x1) << GPIO_EVER_P15_Pos)
#define GPIO_EVER_P16_Pos           16           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P16               (_U(0x1) << GPIO_EVER_P16_Pos)
#define GPIO_EVER_P17_Pos           17           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P17               (_U(0x1) << GPIO_EVER_P17_Pos)
#define GPIO_EVER_P18_Pos           18           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P18               (_U(0x1) << GPIO_EVER_P18_Pos)
#define GPIO_EVER_P19_Pos           19           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P19               (_U(0x1) << GPIO_EVER_P19_Pos)
#define GPIO_EVER_P20_Pos           20           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P20               (_U(0x1) << GPIO_EVER_P20_Pos)
#define GPIO_EVER_P21_Pos           21           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P21               (_U(0x1) << GPIO_EVER_P21_Pos)
#define GPIO_EVER_P22_Pos           22           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P22               (_U(0x1) << GPIO_EVER_P22_Pos)
#define GPIO_EVER_P23_Pos           23           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P23               (_U(0x1) << GPIO_EVER_P23_Pos)
#define GPIO_EVER_P24_Pos           24           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P24               (_U(0x1) << GPIO_EVER_P24_Pos)
#define GPIO_EVER_P25_Pos           25           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P25               (_U(0x1) << GPIO_EVER_P25_Pos)
#define GPIO_EVER_P26_Pos           26           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P26               (_U(0x1) << GPIO_EVER_P26_Pos)
#define GPIO_EVER_P27_Pos           27           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P27               (_U(0x1) << GPIO_EVER_P27_Pos)
#define GPIO_EVER_P28_Pos           28           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P28               (_U(0x1) << GPIO_EVER_P28_Pos)
#define GPIO_EVER_P29_Pos           29           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P29               (_U(0x1) << GPIO_EVER_P29_Pos)
#define GPIO_EVER_P30_Pos           30           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P30               (_U(0x1) << GPIO_EVER_P30_Pos)
#define GPIO_EVER_P31_Pos           31           /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P31               (_U(0x1) << GPIO_EVER_P31_Pos)
#define GPIO_EVER_MASK              _U(0xFFFFFFFF) /**< \brief (GPIO_EVER) MASK Register */

/* -------- GPIO_EVERS : (GPIO Offset: 0x184) ( /W 32) port Event Enable Register - Set -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t P0:1;             /*!< bit:      0  Event Enable                       */
    uint32_t P1:1;             /*!< bit:      1  Event Enable                       */
    uint32_t P2:1;             /*!< bit:      2  Event Enable                       */
    uint32_t P3:1;             /*!< bit:      3  Event Enable                       */
    uint32_t P4:1;             /*!< bit:      4  Event Enable                       */
    uint32_t P5:1;             /*!< bit:      5  Event Enable                       */
    uint32_t P6:1;             /*!< bit:      6  Event Enable                       */
    uint32_t P7:1;             /*!< bit:      7  Event Enable                       */
    uint32_t P8:1;             /*!< bit:      8  Event Enable                       */
    uint32_t P9:1;             /*!< bit:      9  Event Enable                       */
    uint32_t P10:1;            /*!< bit:     10  Event Enable                       */
    uint32_t P11:1;            /*!< bit:     11  Event Enable                       */
    uint32_t P12:1;            /*!< bit:     12  Event Enable                       */
    uint32_t P13:1;            /*!< bit:     13  Event Enable                       */
    uint32_t P14:1;            /*!< bit:     14  Event Enable                       */
    uint32_t P15:1;            /*!< bit:     15  Event Enable                       */
    uint32_t P16:1;            /*!< bit:     16  Event Enable                       */
    uint32_t P17:1;            /*!< bit:     17  Event Enable                       */
    uint32_t P18:1;            /*!< bit:     18  Event Enable                       */
    uint32_t P19:1;            /*!< bit:     19  Event Enable                       */
    uint32_t P20:1;            /*!< bit:     20  Event Enable                       */
    uint32_t P21:1;            /*!< bit:     21  Event Enable                       */
    uint32_t P22:1;            /*!< bit:     22  Event Enable                       */
    uint32_t P23:1;            /*!< bit:     23  Event Enable                       */
    uint32_t P24:1;            /*!< bit:     24  Event Enable                       */
    uint32_t P25:1;            /*!< bit:     25  Event Enable                       */
    uint32_t P26:1;            /*!< bit:     26  Event Enable                       */
    uint32_t P27:1;            /*!< bit:     27  Event Enable                       */
    uint32_t P28:1;            /*!< bit:     28  Event Enable                       */
    uint32_t P29:1;            /*!< bit:     29  Event Enable                       */
    uint32_t P30:1;            /*!< bit:     30  Event Enable                       */
    uint32_t P31:1;            /*!< bit:     31  Event Enable                       */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} GPIO_EVERS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define GPIO_EVERS_OFFSET           0x184        /**< \brief (GPIO_EVERS offset) Event Enable Register - Set */

#define GPIO_EVERS_P0_Pos           0            /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P0               (_U(0x1) << GPIO_EVERS_P0_Pos)
#define GPIO_EVERS_P1_Pos           1            /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P1               (_U(0x1) << GPIO_EVERS_P1_Pos)
#define GPIO_EVERS_P2_Pos           2            /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P2               (_U(0x1) << GPIO_EVERS_P2_Pos)
#define GPIO_EVERS_P3_Pos           3            /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P3               (_U(0x1) << GPIO_EVERS_P3_Pos)
#define GPIO_EVERS_P4_Pos           4            /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P4               (_U(0x1) << GPIO_EVERS_P4_Pos)
#define GPIO_EVERS_P5_Pos           5            /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P5               (_U(0x1) << GPIO_EVERS_P5_Pos)
#define GPIO_EVERS_P6_Pos           6            /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P6               (_U(0x1) << GPIO_EVERS_P6_Pos)
#define GPIO_EVERS_P7_Pos           7            /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P7               (_U(0x1) << GPIO_EVERS_P7_Pos)
#define GPIO_EVERS_P8_Pos           8            /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P8               (_U(0x1) << GPIO_EVERS_P8_Pos)
#define GPIO_EVERS_P9_Pos           9            /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P9               (_U(0x1) << GPIO_EVERS_P9_Pos)
#define GPIO_EVERS_P10_Pos          10           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P10              (_U(0x1) << GPIO_EVERS_P10_Pos)
#define GPIO_EVERS_P11_Pos          11           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P11              (_U(0x1) << GPIO_EVERS_P11_Pos)
#define GPIO_EVERS_P12_Pos          12           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P12              (_U(0x1) << GPIO_EVERS_P12_Pos)
#define GPIO_EVERS_P13_Pos          13           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P13              (_U(0x1) << GPIO_EVERS_P13_Pos)
#define GPIO_EVERS_P14_Pos          14           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P14              (_U(0x1) << GPIO_EVERS_P14_Pos)
#define GPIO_EVERS_P15_Pos          15           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P15              (_U(0x1) << GPIO_EVERS_P15_Pos)
#define GPIO_EVERS_P16_Pos          16           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P16              (_U(0x1) << GPIO_EVERS_P16_Pos)
#define GPIO_EVERS_P17_Pos          17           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P17              (_U(0x1) << GPIO_EVERS_P17_Pos)
#define GPIO_EVERS_P18_Pos          18           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P18              (_U(0x1) << GPIO_EVERS_P18_Pos)
#define GPIO_EVERS_P19_Pos          19           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P19              (_U(0x1) << GPIO_EVERS_P19_Pos)
#define GPIO_EVERS_P20_Pos          20           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P20              (_U(0x1) << GPIO_EVERS_P20_Pos)
#define GPIO_EVERS_P21_Pos          21           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P21              (_U(0x1) << GPIO_EVERS_P21_Pos)
#define GPIO_EVERS_P22_Pos          22           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P22              (_U(0x1) << GPIO_EVERS_P22_Pos)
#define GPIO_EVERS_P23_Pos          23           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P23              (_U(0x1) << GPIO_EVERS_P23_Pos)
#define GPIO_EVERS_P24_Pos          24           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P24              (_U(0x1) << GPIO_EVERS_P24_Pos)
#define GPIO_EVERS_P25_Pos          25           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P25              (_U(0x1) << GPIO_EVERS_P25_Pos)
#define GPIO_EVERS_P26_Pos          26           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P26              (_U(0x1) << GPIO_EVERS_P26_Pos)
#define GPIO_EVERS_P27_Pos          27           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P27              (_U(0x1) << GPIO_EVERS_P27_Pos)
#define GPIO_EVERS_P28_Pos          28           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P28              (_U(0x1) << GPIO_EVERS_P28_Pos)
#define GPIO_EVERS_P29_Pos          29           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P29              (_U(0x1) << GPIO_EVERS_P29_Pos)
#define GPIO_EVERS_P30_Pos          30           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P30              (_U(0x1) << GPIO_EVERS_P30_Pos)
#define GPIO_EVERS_P31_Pos          31           /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P31              (_U(0x1) << GPIO_EVERS_P31_Pos)
#define GPIO_EVERS_MASK             _U(0xFFFFFFFF) /**< \brief (GPIO_EVERS) MASK Register */

